# UpDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewOrientation3D..::..UpDirection Property
ViewOrientation3D Class See Also
---
The up direction vector
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public XYZ UpDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UpDirection As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ UpDirection {
	XYZ^ get ();
}
```

# See Also
ViewOrientation3D Class
Autodesk.Revit.DB Namespace